In [1]:
import requests
import os
import hashlib
import io
import time
import pandas as pd

In [1]:
# Download the db
"https://onedrive.live.com/download?cid=FD520DDC6BE92730&resid=FD520DDC6BE92730%21616&authkey=AEeP_4E1uh-vyDE"

'https://onedrive.live.com/download?cid=FD520DDC6BE92730&resid=FD520DDC6BE92730%21616&authkey=AEeP_4E1uh-vyDE'

In [2]:
# Connect
DB_FILENAME = 'NYC-311-2M.db'
import sqlite3 as db
disk_engine = db.connect(DB_FILENAME)

__Simple substring matching: the LIKE operator__. Suppose we just want to look at the counts for all complaints that have the word noise in them. You can use the LIKE operator combined with the string wildcard, %, to look for case-insensitive substring matches.

In [4]:
query = '''
    SELECT ComplaintType AS Type, COUNT(*) AS freq
    FROM data
    WHERE ComplaintType LIKE "%noise%"
    GROUP BY type
    ORDER BY -freq
'''

df_noisy = pd.read_sql_query(query, disk_engine)
df_noisy.head()

                      Type   freq
0                    Noise  54165
1  Noise - Street/Sidewalk  48436
2       Noise - Commercial  42422
3          Noise - Vehicle  18370
4             Noise - Park   4020

__Case-insensitive grouping: COLLATE NOCASE__. One way to carry out the preceding query in a case-insensitive way is to add a COLLATE NOCASE qualifier to the GROUP BY clause.

Let's filter out the 'None' cases as well, while we are at it. We can use <> to denote "not equal to" in SQL.

In [8]:
query = '''
    SELECT City AS name, COUNT(*) AS freq
    FROM data
    WHERE name <> 'None'
    GROUP BY name COLLATE NOCASE
    ORDER BY -freq
    LIMIT 10
'''

df_whiny_cities2 = pd.read_sql_query(query, disk_engine)
df_whiny_cities2

            name    freq
0       BROOKLYN  579363
1       NEW YORK  385655
2          BRONX  342533
3  STATEN ISLAND   92509
4        Jamaica   46683
5       Flushing   35504
6        ASTORIA   31873
7      Ridgewood   21618
8       Woodside   15932
9         Corona   15740

In [9]:
# Lastly, for later use, let's save the names of just the top seven (7) cities by numbers of complaints.
TOP_CITIES = list(df_whiny_cities2.head(7)['name'])
TOP_CITIES

['BROOKLYN',
 'NEW YORK',
 'BRONX',
 'STATEN ISLAND',
 'Jamaica',
 'Flushing',
 'ASTORIA']

In [10]:
disk_engine.close()